; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v7 ?v9)
             (pred_8 ?v12 ?v8)
             (pred_11 ?v7 ?v8)
             (pred_9 ?v6 ?v7 )
	     (pred_10 ?v7)
             (pred_1 ?v13)
             (pred_12 ?v12)
             (pred_3 ?v8)
             (pred_7 ?v7)
             (pred_2 ?v12)
             (pred_4 ?v7)
             (pred_6 ))



(:action op_5
:parameters (?v2 ?v10 ?v3 ?v4)
:precondition (and (pred_1 ?v2) (pred_1 ?v10) (pred_12 ?v3) (pred_3 ?v4)
          (pred_5 ?v2 ?v10) (pred_8 ?v3 ?v4)
                   (pred_11 ?v10 ?v4) (pred_10 ?v2) 
                   (pred_7 ?v10) (pred_2 ?v3))
:effect (and  (pred_4 ?v10) (not (pred_7 ?v10))))


(:action op_4
:parameters (?v2 ?v5)
:precondition (and (pred_1 ?v2) (pred_1 ?v5)
               (pred_10 ?v2) (pred_5 ?v2 ?v5) (pred_4 ?v5))
:effect (and (pred_10 ?v5) (not (pred_10 ?v2))))

(:action op_1
:parameters (?v2 ?v3)
:precondition (and (pred_1 ?v2) (pred_12 ?v3) 
                  (pred_10 ?v2) (pred_9 ?v3 ?v2) (pred_6 ))
:effect (and (pred_2 ?v3)
   (not (pred_9 ?v3 ?v2)) (not (pred_6 ))))


(:action op_2
:parameters (?v2 ?v11 ?v1)
:precondition (and (pred_1 ?v2) (pred_12 ?v11) (pred_12 ?v1)
                  (pred_10 ?v2) (pred_2 ?v1) (pred_9 ?v11 ?v2))
:effect (and (pred_2 ?v11) (pred_9 ?v1 ?v2)
        (not (pred_2 ?v1)) (not (pred_9 ?v11 ?v2))))

(:action op_3
:parameters (?v2 ?v3)
:precondition (and (pred_1 ?v2) (pred_12 ?v3) 
                  (pred_10 ?v2) (pred_2 ?v3))
:effect (and (pred_6 ) (pred_9 ?v3 ?v2) (not (pred_2 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_16 obj_17 obj_01 obj_14 obj_06 obj_10 obj_07 obj_02 obj_12 obj_08 obj_11 obj_04 obj_03 obj_15 obj_05 obj_19
    obj_09 obj_13
    obj_18 obj_20
    )

    (:init
       (pred_6)

       (pred_1 obj_16)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_12)
       (pred_1 obj_08)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_03)
       (pred_1 obj_15)
       (pred_1 obj_05)
       (pred_1 obj_19)
       (pred_3 obj_09)
       (pred_3 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_20)

       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_17 obj_01)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_01 obj_14)
       (pred_5 obj_01 obj_17)
       (pred_5 obj_14 obj_02)
       (pred_5 obj_14 obj_01)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_02 obj_14)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_12 obj_08)
       (pred_5 obj_12 obj_06)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_04)
       (pred_5 obj_11 obj_07)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_04 obj_19)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_03 obj_12)
       (pred_5 obj_15 obj_05)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_19 obj_04)
       (pred_5 obj_19 obj_05)
       (pred_7 obj_14)
       (pred_7 obj_19)
       (pred_11  obj_14 obj_09)
       (pred_11  obj_19 obj_13)
       (pred_4 obj_16)
       (pred_4 obj_17)
       (pred_4 obj_01)
       (pred_4 obj_06)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_04)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_05)

       (pred_8  obj_18 obj_09)
       (pred_8  obj_20 obj_13)
       (pred_9 obj_18 obj_12)
       (pred_9 obj_20 obj_01)
       (pred_10 obj_07)
    )

    (:goal (and
       (pred_9 obj_20 obj_10)
    ))
(:constraints
  (always (not (pred_10 obj_17)))
)
)

; plan
1. (op_4 obj_07 obj_01)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_01)
   goals met: 0 of 1
2. (op_1 obj_01 obj_20)
   deleted: (pred_9 obj_20 obj_01) (pred_6)
   added: (pred_2 obj_20)
   goals met: 0 of 1
3. (op_4 obj_01 obj_07)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_07)
   goals met: 0 of 1
4. (op_4 obj_07 obj_10)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_10)
   goals met: 0 of 1
5. (op_3 obj_10 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_6) (pred_9 obj_20 obj_10)
   goals met: 1 of 1
